Autodesk.Revit.DB.Electrical.ElectricalSystem.IsCircuitPathValid(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Checks whether the list of the electrical system circuit path node position is valid.
Remarks:
The length of the list should be more than one, the first node should be the position of the panel where the circuit begins at, the adjacent nodes should not be too close, and should be in the same level or on the same vertical line, to keep each segment of the circuit path always horizontal or vertical.
nodes:
The list of the electrical system circuit path node position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Electrical.ElectricalSystem.SetCircuitPath(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Sets the electrical system circuit path by the list of node position.
Remarks:
If succeed, it will also change the CircuitPathMode property to Custom mode implicitly.
nodes:
The list of the circuit path node position.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The list of the electrical system circuit path node position is not valid. The length of the list should be more than one, the first node should be the position of the panel where the circuit begins at, the adjacent nodes should not be too close, and should be in the same level or on the same vertical line, to keep each segment of the circuit path always horizontal or vertical.
Also note that the first node position should be the position of the connector (the one connects to the circuit) of the panel, but not the origin of the panel instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2018

Autodesk.Revit.DB.Electrical.ElectricalSystem.SelectPanel(Autodesk.Revit.DB.FamilyInstance)
Set the panel for the Electrical System.
Remarks:
If successful, the panel will be set for the system. Otherwise the exception will be thrown.
This method will only function with the Autodesk Revit MEP application.
panel:
The panel of the electrical system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The panel does not have enough slots and Feed Through Lugs is unchecked or already in use.
-or-
Thrown when the panel cannot be set for the electrical system.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.Create(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Electrical.ElectricalSystemType)
Creates a new MEP Electrical System element from an unused Connector.
connector:
The Connector to create this Electrical System.
elecSysType:
The System Type of electrical system.
Returns:
If successful a new MEP Electrical System element within the project, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2018

Autodesk.Revit.DB.Electrical.ElectricalSystem.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.Electrical.ElectricalSystemType)
Creates a new MEP Electrical System element from a set of electrical components.
document:
The Document.
electComponents:
The electrical components in this system.
elecSysType:
The System Type of electrical system.
Returns:
If successful a new MEP Electrical System element within the project, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There should be at least one component that can create the specified circuit type
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2018

Autodesk.Revit.DB.Electrical.ElectricalSystem.CircuitConnectionType
The circuit connection type of the electrical system.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The connection type is invalid for this circuit.
You can't assign Feed Through Lugs if the panel's Feed Through Lugs option is unchecked.
If the circuit's base panel is not a data panel or transformer panel, the circuit connection type can't be set to NotApplicable.
If the circuit's base panel is a data panel or transformer pane, it must be set to NotApplicable.
If the circuit doesn't have a base panel, it must be set to NotApplicable.
-or-
When setting this property: Invalid connection type.
Since:
2020

Autodesk.Revit.DB.Electrical.ElectricalSystem.IsBasePanelFeedThroughLugsOccupied
Checks if the feed through lugs of the base panel is already occupied.
Since:
2020

Autodesk.Revit.DB.Electrical.ElectricalSystem.Ways
The circuit ways used in the Electrical System.
Remarks:
This property is used to retrieve the ways of the Electrical System on a panel.
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalSystem.PhaseLabel
The circuit phase label used in the Electrical System.
Remarks:
This property is used to retrieve the phase label of the Electrical System on a panel.
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalSystem.LoadClassificationAbbreviations
The LoadClassification Abbreviations used in the Electrical System.
Remarks:
This property is used to retrieve the LoadClassification Abbreviations of the Electrical System.
There may be one or more load classification in use in which case they will be semi-colon delimited.
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalSystem.Frame
The Frame value of the Electrical System.
Remarks:
This property is used to retrieve the Frame value of the Electrical System.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for frame is not a number
-or-
When setting this property: The given value for frame is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for frame must be non-negative.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power and Circuit Type is NOT Space!
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalSystem.LoadName
The LoadName of the Electrical System.
Remarks:
This property is used to retrieve the LoadName of the Electrical System.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.WireType
The wire type of the Electrical System.
Remarks:
This property is used to retrieve the wire type of the Electrical System.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSystem.SlotIndex
The Slots where the Electrical System is located in its panel.
Remarks:
This property is used to retrieve the slots of the Electrical System.
There may be one or more slot in use in which case they will be comma delimited.
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalSystem.CircuitNamingIndex
The Circuit Naming Index where the Electrical System is located in its panel.
The Circuit Naming Index is used to retrieve the Circuit Naming Index of the Electrical System.
Since:
2021